<template>
    <div class="product-list">
        <ProductItem v-for="product in products" :key="product.id" :product="product" />
    </div>
</template>

<script>
import ProductItem from './ProductItem.vue'
export default {
    name: "ProductList",
    data() {
        return {
            products: [
                { id: 1, name: 'Наименование товара', description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк', price: 10000, imageUrl: '' },
                { id: 2, name: 'Наименование товара', description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк', price: 10000, imageUrl: '' },
                { id: 3, name: 'Наименование товара', description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк', price: 10000, imageUrl: '' },
                { id: 4, name: 'Наименование товара', description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк', price: 10000, imageUrl: '' },
                { id: 5, name: 'Наименование товара', description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк', price: 10000, imageUrl: '' },
                { id: 6, name: 'Наименование товара', description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк', price: 10000, imageUrl: '' },
                { id: 7, name: 'Наименование товара', description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк', price: 10000, imageUrl: '' },
                { id: 8, name: 'Наименование товара', description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк', price: 10000, imageUrl: '' },
                { id: 9, name: 'Наименование товара', description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк', price: 10000, imageUrl: '' },
                { id: 10, name: 'Наименование товара', description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк', price: 10000, imageUrl: '' },
                { id: 11, name: 'Наименование товара', description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк', price: 10000, imageUrl: '' },
            ],
        };
    },
    components: { ProductItem }
}
</script>

<style scoped lang="scss">
.product-list {
    display: flex;
    flex-flow: row wrap;
}
</style>
